
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПроизвольныйТекстДо = 	
		"Это страка садержит ашибки
		|втарая строка содержит только одну ошибку?
		|
		|
		|yes
		|";

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТекст(Команда)
	ПроверитьТекстНаСервере(ПроизвольныйТекстДо);
КонецПроцедуры

&НаСервере
Процедура ПроверитьТекстНаСервере(Знач ТекстовоеСодержимое)
	
	Правописание = Обработки.DEV_Speller.Создать();
	Результат = Правописание.checkText(ТекстовоеСодержимое);
	
	ПроизвольныйТекстПодсказки = "";
	списокСтрок = Новый Массив();
	ТекущаяПозиция = 0;
	Для Каждого элементОтвета Из Результат Цикл
		
		похожиеСлова = "";
		Для Каждого элементПодсказки Из элементОтвета.s Цикл
			похожиеСлова = похожиеСлова + " -> " + элементПодсказки + Символы.ПС;
		КонецЦикла;			
		ПроизвольныйТекстПодсказки = ПроизвольныйТекстПодсказки + СтрШаблон("%2%1%3"
			, Символы.ПС
			, элементОтвета.word
			, похожиеСлова
		);
		
		строкаОбычная = Сред(ТекстовоеСодержимое, ТекущаяПозиция + 1, элементОтвета.pos - ТекущаяПозиция); 
		строкаФорматированная = Сред(ТекстовоеСодержимое, элементОтвета.pos + 1, элементОтвета.len);
		списокСтрок.Добавить(строкаОбычная);
		списокСтрок.Добавить(Новый ФорматированнаяСтрока(строкаФорматированная, , WebЦвета.Красный));
		ТекущаяПозиция = элементОтвета.pos + элементОтвета.len;
			
	КонецЦикла;
	
	Если ТекущаяПозиция<СтрДлина(ТекстовоеСодержимое) Тогда 
		строкаОбычная = Сред(ТекстовоеСодержимое, ТекущаяПозиция + 1, СтрДлина(ТекстовоеСодержимое) - ТекущаяПозиция); 
		списокСтрок.Добавить(строкаОбычная);
	КонецЕсли;
	ПроизвольныйТекстПосле = Новый ФорматированнаяСтрока(списокСтрок);
	
КонецПроцедуры






