#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем HTTPСоединениеСпеллер Экспорт;

#КонецОбласти

Функция HTTPСоединениеСпеллер(Знач Таймаут=5) Экспорт 
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
	СпеллерСервер = "speller.yandex.net";
	HTTPСоединение = Новый HTTPСоединение(СпеллерСервер,443,,,,Таймаут,SSL);
	
	//ТелеграмБотСерверAPI = Константы.DEV_ТелеграмБотСерверAPI.Получить();
	//Если ПустаяСтрока(ТелеграмБотСерверAPI) Тогда 
	//	HTTPСоединение = Новый HTTPСоединение(СпеллерСервер,443,,,,Таймаут,SSL);
	//Иначе 
	//	ТелеграмБотСерверAPIНастройки = СтрРазделить(ТелеграмБотСерверAPI, ":", Истина);
	//	HTTPСоединение = Новый HTTPСоединение(ТелеграмБотСерверAPIНастройки[0],Число(ТелеграмБотСерверAPIНастройки[1]),,,,Число(ТелеграмБотСерверAPIНастройки[2]),SSL);
	//КонецЕсли;
	
	Возврат HTTPСоединение; 
	
КонецФункции

// Вызов метода Спеллера по собранной строке запроса
//
Функция ВыполнитьМетодСпеллера(ИмяМетода, Параметры = Неопределено) 
	
	Попытка
		
		Если HTTPСоединениеСпеллер = Неопределено Тогда 
			HTTPСоединениеСпеллер = HTTPСоединениеСпеллер();
		КонецЕсли;
		
		СтрокаПараметров = "";
		Если ЗначениеЗаполнено(Параметры) И Параметры.Количество() > 0 Тогда
			Для каждого Параметр Из Параметры Цикл
				Если ТипЗНЧ(Параметр.Значение)=Тип("Булево") Тогда 
					СтрокаПараметров = СтрокаПараметров + "&"+ Параметр.Ключ + "=" + Формат(Параметр.Значение, "БЛ=false; БИ=true");
				Иначе 
					СтрокаПараметров = СтрокаПараметров + "&"+ Параметр.Ключ + "=" + Параметр.Значение;
				КонецЕсли;
			КонецЦикла;
			СтрокаПараметров = "?" + Сред(СтрокаПараметров,2);
		КонецЕсли;	
		
		HTTPЗапрос = Новый HTTPЗапрос("/services/spellservice.json/" + ИмяМетода + СтрокаПараметров);
		HTTPОтвет = HTTPСоединениеСпеллер.Получить(HTTPЗапрос);
		HTTPОтвет_Тело = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		
		// Преобразуем ответ в структуру
		Чтение = Новый ЧтениеJSON();
		Чтение.УстановитьСтроку(HTTPОтвет_Тело);
		ОтветСтруктура = ПрочитатьJSON(Чтение);
		Чтение.Закрыть();
		//ОтветСтруктура.Вставить("ТелоОтвета", HTTPОтвет_Тело);
	
	Исключение
		
		ОписаниеОшибки = "Ошибка при выполнении метода " + ИмяМетода + "()" + Символы.ПС + ОписаниеОшибки();
		ОтветСтруктура = Новый Структура;
		ОтветСтруктура.Вставить("ok", False);
		ОтветСтруктура.Вставить("ТелоОтвета", ОписаниеОшибки);
				
	КонецПопытки;
	
	Возврат ОтветСтруктура;
	
КонецФункции

Функция checkText(Знач text) Экспорт  
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("text", text);
	
	Возврат ВыполнитьМетодСпеллера("checkText", ДополнительныеПараметры);
	
КонецФункции

#Область Инициализация

HTTPСоединениеСпеллер = Неопределено;

#КонецОбласти

#КонецЕсли